# FPenSize

## Description
Function FPenSize returns the active pen size setting (in mils).

```pascal
FUNCTION FPenSize : INTEGER;
```

```python
def vs.FPenSize():
    return INTEGER
```

## Examples
==== VectorScript ====
```pascal
CurrPenSize:=FPenSize;
```
==== Python ====
```python
CurrPenSize = vs.FPenSize()
```

## Version
Availability: from All Versions

## Category
* Document Attributes